app/views/users/show.html.erb

<ul>
  <% @user.friendships.each do |friendship| %>
---
SELECT "friendships".* FROM "friendships" WHERE ("friendships".user_id = 3)