app/controllers/friendships_controller.rb

INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES (3, 2, '2011-10-21 04:47:07.696906', '2011-10-21 04:47:07.696906')
---
  def create
    @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
    if @friendship.save

SELECT "friendships".* FROM "friendships" WHERE ("friendships".user_id = 3) AND ("friendships"."id" = 1) LIMIT 1
DELETE FROM "friendships" WHERE ("friendships"."id" = 1)
---
  def destroy
    @friendship = current_user.friendships.find(params[:id])
    @friendship.destroy