app/controllers/posts_controller.rb

  def index
    @posts = Post.all(:order => "created_at DESC")
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

  def create
    @post = Post.create(:message => params[:message])
---
INSERT INTO "posts" ("message", "created_at", "updated_at") VALUES ('ozzy smells', '2011-10-06 04:44:15.458968', '2011-10-06 04:44:15.458968')