app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("username", "email", "password_hash", "password_salt", "created_at", "updated_at") VALUES ('MaRkOw', 'timmarkow@gmail.com', '$2a$10$Bj.ycoUoCwu4cQzqjtNktuyCqEqCOG31KKvNwLCxtaM1LT5nBn/sW', '$2a$10$Bj.ycoUoCwu4cQzqjtNktu', '2011-10-12 05:01:30.674442', '2011-10-12 05:01:30.674442')